# -*- coding: utf-8 -*-
from psycopg2 import connect, Error
from sentence_transformers import SentenceTransformer
import json

model = SentenceTransformer(r"C:\Users\user\Downloads\outp_model-20230909T214815Z-001\outp_model")
# model.encode('«Последние десять лет я больше всего хотел превратить политические писания в искусство», — сказал Оруэлл в 1946 году, и до нынешних дней его книги и статьи убедительно показывают, каким может стать наш мир. Большой Брат по-прежнему не смыкает глаз, а некоторые равные — равнее прочих…')[0]
# model.encode('Повесть Э.Хемингуэя «Старик и море», за которую автор получил в 1954 году Нобелевскую премию, уже давно стала современной классикой. История рыбака Сантьяго — это история нелегкого пути человека на земле, каждый день ведущего борьбу за жизнь и вместе с тем стремящегося сосуществовать в гармонии и согласии с миром, осознающего себя не одиночкой, как было в предыдущих произведениях писателя, а частицей огромного и прекрасного мира.'[:256])[0]
try:
    with connect(
        host="158.160.19.67",
        port="5438",
        user='user',
        password='password',
        database="Books"
    ) as connection:
        arra= {}
        cursor=connection.cursor()
        #cursor.execute(f"""INSERT INTO Books VALUES (1,'1984 - Джордж Оруэлл','1984 - Джордж Оруэлл','«Последние десять лет я больше всего хотел превратить политические писания в искусство», — сказал Оруэлл в 1946 году, и до нынешних дней его книги и статьи убедительно показывают, каким может стать наш мир. Большой Брат по-прежнему не смыкает глаз, а некоторые равные — равнее прочих…',' "Соңгы ун елда мин сәяси язмаларны сәнгатькә әйләндерергә теләдем", — дип әйткән Оруэлл 1946 елда, һәм бүгенге көнгә кадәр аның китаплары һәм мәкаләләре безнең дөньяның нинди була алуын ышандырырлык итеп күрсәтә. Олы абый һаман да күзләрен йоммый, ә кайберләре башкалардан тигезрәк…','https://storage.yandexcloud.net/voronka-storage/books/1984.txt') """)
        #cursor.execute(f"""INSERT INTO Books VALUES (2,'Старик и море','Карт һәм диңгез','Повесть Э.Хемингуэя «Старик и море», за которую автор получил в 1954 году Нобелевскую премию, уже давно стала современной классикой. История рыбака Сантьяго — это история нелегкого пути человека на земле, каждый день ведущего борьбу за жизнь и вместе с тем стремящегося сосуществовать в гармонии и согласии с миром, осознающего себя не одиночкой, как было в предыдущих произведениях писателя, а частицей огромного и прекрасного мира.','Карт һәм диңгез Э.Хемингуэйның «карт һәм диңгез» повесте, аның өчен автор 1954 елда Нобель премиясе ала, күптән инде заманча классикага әверелә. Сантьяго балыкчысының тарихы-җирдә көн саен яшәү өчен көрәш алып барган һәм шул ук вакытта дөнья белән гармониядә һәм килешүдә бергә яшәргә омтылган, үзен язучының элеккеге әсәрләрендәге кебек ялгыз түгел, ә зур һәм матур дөньяның бер өлеше итеп аңлаган кешенең авыр юлы тарихы.','') """)
        #cursor.execute(f"""INSERT INTO Books VALUES (3,'Приключения Гекльберри Финна','Гекльберри Финн Маҗаралары','Роман «Приключения Гекльберри Финна» давно стал классикой и многими считается наиболее значительным вкладом Марка Твена в американскую и мировую литературу. Простым, доступным языком, с добротой и юмором, через своего юного героя, автор знакомит читателя с жизнью Америки 19-го века, не чураясь отнюдь не детских проблем. Беспризорник Гек, сирота при живом отце, вынужден спасаться бегством, несмотря на то, что еще с первой книги его жизнь вроде бы изменилась к лучшему. Его попутчиком становится беглый негр Джим. Двигаясь вниз по Миссисипи, мальчик попадает во множество ситуаций из которых, подчас, и не каждому взрослому легко будет найти выход и принять правильное решение. Через приключения своего героя Марк Твен поднимает множество социальных проблем общества, некоторые из которых продолжают оставаться актуальными до сих пор. Это и проблемы беспризорников, пьянство, расовая нетерпимость, рабство, кровная семейная месть, доверчивость и мошенничество, на страницах романа мельком встречаются даже свои «Ромео и Джульета».','«Гекльберри Финн маҗаралары» романы күптән инде классикага әверелгән һәм күпләр тарафыннан Америка һәм дөнья әдәбиятына Марк Твенның иң әһәмиятле өлеше дип санала. Гади, аңлаешлы телдә, игелек һәм юмор белән, яшь герое аша, автор укучыны 19 гасыр Америка тормышы белән таныштыра, балачак проблемаларыннан читләшми. Йортсыз Гек, әтисе исән чакта ятим, качарга мәҗбүр була, беренче китаптан ук аның тормышы яхшы якка үзгәргән кебек тоелса да. Аның юлдашы Качкын кара тәнле Джим була. Миссисипи буйлап барганда, малай күп кенә ситуацияләргә эләгә, кайвакыт, һәм һәр өлкән кешегә дә чыгу юлын табу һәм дөрес карар кабул итү җиңел булмаячак. Үз героеның маҗаралары аша Марк Твен җәмгыятьнең күп кенә социаль проблемаларын күтәрә, аларның кайберләре бүгенге көнгә кадәр актуаль булып кала. Бу шулай ук йортсызлар проблемалары, эчкечелек, раса түземсезлеге, коллык, канлы гаилә үч алуы, ышанучанлык һәм алдау, Роман битләрендә вак-төяк очрыйлар хәтта үз Ромео һәм Джульетта',
#'https://storage.yandexcloud.net/voronka-storage/books/priklyuchenie_geklberri_finna.txt') """)
        vect = [float(i) for i in model.encode('«Последние десять лет я больше всего хотел превратить политические писания в искусство», — сказал Оруэлл в 1946 году, и до нынешних дней его книги и статьи убедительно показывают, каким может стать наш мир. Большой Брат по-прежнему не смыкает глаз, а некоторые равные — равнее прочих…')]
        print(type(vect[0]))
        # mp = json.dumps(vect)
        cursor.execute(f"UPDATE Books SET vector=(?) WHERE book_id=1",vect[0])

        cursor.execute("""SELECT * FROM Books""")
        record = cursor.fetchall()
        print(record)
except Error as e:
    print(e)



def find_top_5():
    pass


